questions = [
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני מצליח.ה להסתגל לשינויי", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני יכול.ה להתמודד עם כל דבר", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני רואה את הצד המשעשע בדברים", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'התמודדות עם לחץ מחזקת אותי", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני נוטה להתאושש בקלות ממחלה או קושי", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'תחת לחץ, אני מתמקד.ת וחושב בבהירות", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני יכול.ה להשיג את המטרות שלי למרות הקשיים", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני לא מתייאש.ת בקלות מכישלונות", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני חושב.ת על עצמי כעל אדם חזק", 
    "'חשבי על החודש האחרון, עד כמה נכון לגביך ההיגד 'אני יכול.ה להתמודד עם רגשות לא נעימים", 
]
options = [
    "לא נכון בכלל",
    "נכון לעיתים רחוקות",
    "לפעמים נכון",
    "נכון לעיתים קרובות",
    "נכון כמעט כל הזמן"
]

if __name__ == "__main__":
    for item in questions:
        print(item)